app/Http/Controllers/ArticleController.php

    public function index()
    {
        //$articles = Article::all();
        $articles = Article::orderBy('id', 'desc')->paginate(5);
---
select * from `articles` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `articles`