app/Http/Controllers/HomeController.php

select * from `users` where `users`.`id` = '1' limit 1
---
    public function index()
    {
        $userId = Auth::id();

        $user = User::find($userId);