app/Http/Controllers/NoteController.php

    public function index()
    {
        //$notes = Note::orderBy('id', 'desc')->paginate(3);
        $notes = Note::with('user')->where('user_id', Auth::user()->id)->orderBy('id', 'desc')->paginate(3);
---
select * from `notes` where `user_id` = '1' order by `id` desc limit 3 offset 0
select * from `users` where `users`.`id` in ('1')
select count(*) as aggregate from `notes` where `user_id` = '1'