app/Http/Controllers/StoryController.php

    public function index()
    {
        //declaration of variable stories and get the stories from data base
        $stories = Story::where('status', 1)->orderBy('id', 'desc')->paginate(5);
---
select * from `stories` where `status` = '1' order by `id` desc limit 5 offset 0
select count(*) as aggregate from `stories` where `status` = '1'